function Fibonachi(n) {
  const fib = [0, 1];                               //o(1)          //دو عدد اول دنباله فیبوناچی مشخص هستش  و ۰ و۱ هستش
  for (let i = 2; i < n; i++) {
    //یک حلقه میزنیم و از ایندکس سوم شروع میکنیم که برابر دو هستش  و تا زمانی که از عدد وارد شده کمتر باشه ادامه میدیم      //o(n)
    fib[i] = fib[i - 1] + fib[i - 2];
  }
  return fib;
}
console.log(Fibonachi(12)); //[0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
//Big O = O(n)    //یک حلقه داشته باشیم لینیر هست و رشد خطی داریم
