// تابع insertionSort آرایه‌ای را به عنوان ورودی می‌گیرد و آن را به صورت مرتب باز می‌گرداند
function insertionSort(arr) {
  // از عنصر دوم شروع می‌کنیم، زیرا فرض می‌کنیم که اولین عنصر به تنهایی مرتب است
  for (let i = 1; i < arr.length; i++) {
    let numInsert = arr[i]; // عنصر جاری که باید در مکان مناسب قرار گیرد
    let j = i - 1; // اندیس آخرین عنصر در بخش مرتب‌شده

    // حلقه while برای جابه‌جایی عناصر بزرگتر به سمت راست
    while (j >= 0 && arr[j] > numInsert) {
      arr[j + 1] = arr[j]; // جابه‌جا کردن عنصر به سمت راست
      j = j - 1; // حرکت به عنصر قبلی
    }

    // قرار دادن عنصر جاری (numInsert) در مکان مناسب
    arr[j + 1] = numInsert;
  }

  return arr; // بازگشت آرایه مرتب‌شده
}

// آزمایش تابع با یک آرایه نمونه
console.log(insertionSort([-2, -90, 78, 2, 4, 56]));

