function QuickSort(arr) {
  if (arr.length < 2) return arr;
  let pivot = arr[arr.length - 1];
  let left = [];
  let right = [];
  for (let i = 0; i < arr.length - 1; i++) {
    if (arr[i] < pivot) {
      left.push(arr[i]);
    } else {
      right.push(arr[i]);
    }
  }
  return [...QuickSort(left), pivot, ...QuickSort(right)];
}

const arr = [-10, -1000, -1, 90, 74, 3, 12, 11];
console.log(QuickSort(arr));
//Big o=nLogn    یک ارایه به طور مرتب تقسیم میشوند
//اخرین عنصر ارایه رو به عنوان pivot در نظر میگیریم بعد عنصر کویچکتر از اون رو به ارایه سمت چپ و بزرگتر رو به ارایه سمت راست میبریم در این مرحله باز pivot رو در نظر میگیریم در ارایه چپی و همچنین در ارایه راستی هم همینطوره 




//الگوریتم کوییک سورت یک آرایه را به بخش‌های کوچکتر تقسیم کرده و سپس هر بخش را جداگانه مرتب می‌کند. فرآیند به این صورت است:

// یک عنصر به نام محور (Pivot) از آرایه انتخاب می‌شود.
// عناصر آرایه به سه بخش تقسیم می‌شوند:
// عناصر کوچکتر از محور
// خود محور
// عناصر بزرگتر از محور
// به صورت بازگشتی همین عملیات برای زیرآرایه‌های "عناصر کوچکتر" و "عناصر بزرگتر" تکرار می‌شود.